{  
   "centaur":{  
      "quote":"Even so the half-brute Centaur leaps down into the vale from the airy height of Ossa: at himself the lofty forests quake in fear, at the horse the plain shakes.",
      "by":"Thebaid VII, Publius Papinius Statius",
      "desc":"The soft twinkling of stars in the night sky finds itself burning wildly in the dark hard eyes of the Centaurs. Augurs of the highest order, they are vouchsafed visions of things yet to be, vistas of the future lighted by the fiercest starfire. Adept in the secret ways of nature, they imparted their vast worldly knowledge to the earliest men, from the herbalist’s art of mending and healing to the fashioning of slender bows for hunting and killing. Part human, part beast, these liminal beings are also creatures of unbridled feral strength, evident in their prowess on the battlefield: with breaths hot and heavy, the Centaurs stride into battle with a bacchanalian frenzy, paving their warpath with slain corpses. With the winds always at their backs, their arrows fly ever true, striking terror into their enemies’ hearts. Few survive the onslaught of the Centaurs.",
      "headOGL":"elijah goh",
      "ogls":[  
         “s. roobini"
      ]
   },
   "dragon":{  
      "quote":"I desired dragons with a profound desire. Of course, I in my timid body did not wish to have them in the neighborhood. But the world that contained even the imagination of Fáfnir was richer and more beautiful, at whatever the cost of peril.",
      "by":"J.R.R. Tolkien",
      "desc":"Within the belly of the beast stirs the fire of an ever-burning hearth, while without the shimmering scales of the great wyrm flickers in iridescent glory, as you watch its snaking body slink towards the mouth of its ancient lair. It raises a claw; whetted sharp and slick, you imagine it lacerating the toughest of leather and the thickest of metals, tearing bodies into streaming ribbons of flesh and blood. As its wings unfurl you see the bleached bones of both animals and humans clanking and clinking on the floor alongside great pieces of gold and jewels — its hoard you had coveted, but now despised. Suddenly it flicks its tongue out, and you feel it smell your growing fear, the tasty cowardice of a lesser creature that has abandoned all hope. It exhales in billowing sulphurous fumes; a rumbling is heard echoing throughout the cave. A dark gaze meets your eyes. For a moment you saw the brilliant sprays of sunfire issue from the Dragon’s throat, and in the ensuing searing heat you could scarcely scream.",
      "headOGL":"hendarto yap",
      "ogls":[  
         "dawn seow",
         "kim tan"
      ]
   },
   "merfolk":{  
      "quote":"I must be a mermaid, Rango. I have no fear of depths and a great fear of shallow living.",
      "by":"<i>The Four-Chambered Heart</i>, Anaïs Nin",
      "desc":"In drowned cities long far removed from human eyes dwell still the Merpeople, part fish, part human, wholly creatures of the oceans in which they inhabit. As they live on in human lore as mere fantastical beings who keep talking lobsters and fishes for company, away in the deepest waters the legend of the Merpeople grow fiercer and wilder. Bubbling with tremendous power they subdue leviathans with great tridents wrought of sacred seastone, fending enemies off with large crescent sweeps of their slicing, sinuous tails. What little books that have been written about them all ascertain one thing: their shadowy, mysterious existence in the minds of terrestrial beings belie a great civilisation prowling the ocean floors.",
      "headOGL":"kenneth lu",
      "ogls":[  
         "lovell lim"
      ]
   },
   "pixie":{  
      "quote":"Fairy roses, fairy rings, turn out sometimes troublesome things.",
      "by":"William Makepeace Thackeray",
      "desc":"The weary traveller entering the misty forests where the tiny flying Pixies reside are bound to see the ignui fatui these creatures conjure in the dying light. Those who know better avoid these wisps, for those enticed by these fairy lights spend the next few days wandering the forests in spiralling circles chasing the mysterious gulling fires. It is this infamous inclination towards benign tricks and deception which has earned the Pixies a reputation similar to the Goblins’, finding endless amusement in tangling and tying hair, startling horses into throwing their riders off and scaring the weak-hearted with ghostly lights and voices.",
      "headOGL":"au khai xiang",
      "ogls":[  
         "tomomi hikawa"
      ]
   },
   "lycanthrope":{  
      "quote":"Never moon a werewolf.",
      "by":"Anonymous",
      "desc":"Amongst us there stalks the shapeshifting skinwalker — the lycanthrope, or werewolf. Nigh indistinguishable from a human save for bridged eyebrows, curved nails and a certain bestial air, these cursed beings straddle the line between monster and man, ever ready to prey on an unsuspecting victim with their agile lycan selves, no different then from the feral wolf of the forest. Their transformation is consummate in the light of a full moon; then, as servants to the mistress of the night, these creatures lose themselves completely, surrendering themselves to the basest animal instincts. Running rabid and wild, a village is slaughtered in the moonlight, and staring at the pale face of their mistress, they lick their bloodstained chops and howl their sinister satisfaction into the long night.",
      "headOGL":"teo shao jin",
      "ogls":[  
         "jannelle leong"
      ]
   },
   "yeti":{  
      "quote":"Listen to me. Love is a Yeti. It is bigger than you and frightening and terrible. It makes loud and vicious noises. It is hungry all the time. It has horns and teeth and the force of its fists is more than anyone can bear. It speeds up time and slows it down. And it has its own aims and missions that those who are lucky enough to see it cannot begin to guess. You might see a Yeti once in your life or never. You might live in a village of them. But in the end, not matter how fast you think you can go, the Yeti is always faster than you, and you can only choose how you say hello to it, and whether you shake its hand.",
      "by":"<i>The Girl Who Soared Over Fairyland and Cut the Moon in Two</i>, Catherynne M. Valente",
      "desc":"In the wintry slopes of the Himalayas a team of explorers spot a lone shadow wandering the mountainsides, braving the harsh snowstorm in what seems to be a shaggy coat of animal fur. When the weather calms large animal footprints are found impressed in the thick snow; but the silhouette of the mysterious figure was clearly human, or so they believed. Before the unrelenting weather covers the tracks the explorers follow them, only to find that they lead to a sheer stony face of a mountain impossible to scale. There, while they stood puzzled and bewildered, their accompanying sherpas, with a stoic look of recognition, point at a distant form now atop the cliff, uttering the word ‘yeti’ to the explorers staring in wild amazement.",
      "headOGL":"pradeep raghunath",
      "ogls":[  
         "heidi mah"
      ]
   },
   "phoenix":{  
      "quote":"And made the glove-winged albatross<br> Scour the ashes of the sea<br> Where Capricorn and Zero cross,<br> A brooding immortality-<br> Such as the charmed phoenix has<br> In the unwithering tree.",
      "by":"<i>Genesis</i>, Geoffrey Hill",
      "desc":"Phoenixes rose as the sparking embers of a star, witnesses to the living light that first broke from the yolk of a primordial darkness before the earth took shape. Since then they had never truly died — every glowing coal of a dying flame shivers with the quivering of a rising phoenix; and if it so chooses, it shall lift itself from the cumbrous dust to be reborn anew. With its scarlet and golden plumage shimmering in the sun, with its golden tail fanning out in rays of light, it deigns to live for centuries more, for kalpas, before it grows weary and plunges itself into smoking ashes, seeking repose. And so the neverending cycle continues, and with another turn of the wheel the phoenix arises once more, meeting the world again with its terrible glowing eyes.",
      "headOGL":"abigail lim",
      "ogls":[  
         "shawn tan"
      ]
   },
   "vampire":{  
      "quote":"As he spoke he smiled, and the lamplight fell on a hardlooking mouth, with very red lips and sharp-looking teeth, as white as ivory. One of my companions whispered to another the line from Burger's <i>Lenore</i>. <br><br>'<i>Denn die Todten reiten Schnell</i>' ('For the dead travel fast')",
      "by":"<i>Dracula</i>, Bram Stoker",
      "desc":"It is right to cower at things that go bump in the night, for the Vampires stalk the dead hours before the saving light of the sun. Spectres that rule the dark, these unholy beings of the undead uphold a cursed covenant — unnatural immortality and black magicks for the blood of the living. And so, rue the night when the Vampires, swathed in their winged capes of darkness, flit and shift by the pale moonlight, and stop you dead in your tracks. They shall beckon you into their open arms, mesmerised by the sight of an ominous vision: the dark moons of their flashing eyes drenched in warm blood as the Vampire plunges its ivory fangs into a throbbing, pulsing artery.",
      "headOGL":"amirul adil",
      "ogls":[  
         "rebecca tan",
         "chiang hai jin"
      ]
   },
   "basilisk":{  
      "quote":"Be thou like the imperial Basilisk <br> Killing thy foe with unapparent wounds!<br>Gaze on Oppression, till at that dread risk<br> Aghast she pass from the Earth’s disk:<br> Fear not, but gaze-for freemen mightier grow,<br> And slaves more feeble, gazing on their foe:-<br> If Hope, and Truth, and Justice may avail,<br> Thou shalt be great-All hail!",
      "by":"<i>Ode to Naples</i>, Percy Bysshe Shelley",
      "desc":"Walking into the lair of a basilisk is not unlike walking into a stone garden, excepting the fact that the sculptures one witnesses are not wrought from the hands of a master carver, but by the single glance from the king of serpents. Hatched from a cock’s egg incubated under a toad, these rare but lethal reptiles petrify all those who dare stare into their monstrous gaze. Victims who manage to avert their eyes, by sheer luck or a stroke of genius, nevertheless despair as the basilisk crushes and asphyxiates them in its great coils, delivering the coup de grâce with its deadly, poisonous fangs.",
      "headOGL":"liana gurung",
      "ogls":[  
         "ong hao zhe"
      ]
   },
   "troll":{  
      "quote":"‘I'm a troll,’ he said. Then he paused, and added, more or less as an afterthought, ‘Fol rol de ol rol.’",
      "by":"<i>Troll Bridge</i>, Neil Gaiman",
      "desc":"Language comes difficult to the Trolls, and so the uttering of unintelligible gibberish is an accomplished feat in itself for these creatures of prodigious strength and immense stupidity. Often found under bridges — the structure keeps the weather out, while the river affords easy sustenance — the Trolls are smelt before they are seen. Occasionally, unfortunate humans and animals curious enough to suss out the stench are instead taken for rare sport by the Trolls, whose days are lived out in constant amusement and distraction by the most trivial of activities. The Trolls’ clumsy mishandling of these newfound playmates, however, often mean an early demise for their ‘friends’, and fresh meat for the vacant days to come.",
      "headOGL":"marisa murni",
      "ogls":[  
         "poh hou sheng"
      ]
   },
   "giant":{  
      "quote":"It was sometimes said that the grey-and-black mountain range which ran like a spine north to south down that part of Faerie had once been a giant, who grew so huge and so heavy that, one day, worn out from the sheer effort of moving and living, he had stretched out on the plain and fallen into a sleep so profound that centuries passed between heartbeats.",
      "by":"<i>Stardust</i>, Neil Gaiman",
      "desc":"Once, in every aeon, a mountain awakes from its stony slumber, and when it does it walks the earth as a colossal Giant, who felled forests and emptied lakes in its wake. Traversing continents in mere days, every Giant terraforms the land it deigns to land its feet on, and for a time the sun is occluded from the sky; the earth trembles in violent rumbling, and hordes of beasts flee wherever they can from the raised foot of an ambling Giant. For all their prodigious might and terrible stature, however, the Giants rarely move for too long before succumbing to the call of the earth once more, sleeping again for another aeon.",
      "headOGL":"teo wenjie",
      "ogls":[  
         "ng kia ling"
      ]
   },
   "elf":{  
      "quote":"Elves are cool, man.",
      "by":"Orlando Bloom",
      "desc":"Diplomatic and naturally docile, the Elves are a civilised race who abhors violence and detests wars. Their steadfast belief in a peaceful way of life make them highly devoted and loyal compatriots to those who prove themselves worthy allies. Conversely, when provoked, the Elves, skilled in archery and the arcane, wreak devastation on whole cities with hailstorms of flaming arrows, leaving them smoking and burning as great fires are raised on the backs of mystic winds called forth by the incantatory magic of Elvish elders. Kingdoms who have known the terrifying might of the Elves displeased are quick to acquiesce to the peace-loving ways of the Elves, least they lay unstoppable siege on their lands once more.",
      "headOGL":"eunice tan",
      "ogls":[  
         "wang guo li",
         "chin ming li"
      ]
   },
   "dwarf":{  
      "quote":"A dwarf who brings a standard along with him to measure his own size, take my word, is a dwarf in more articles than one.",
      "by":"Laurence Sterne",
      "desc":"In the high Nordic mountains groans and rumblings echo throughout the rocky formations, living signs of the Dwarves’ activities that occur deep below the stony facades. Mining, smithing and smelting, the dwarves, despite their stocky and short stature, are masters of their craft, forging great weapons several times their size. Completely isolated in their hot and dark caves, dwarves are rarely seen to wander outside of their abode; and even then, a vagrant dwarf is easily mistaken for a distant boulder rolling down the mountainside. Relative seclusion has bred in the dwarves a singularly temperamental nature; they do not take well to outsiders, often finding offence at the slightest condescension, especially at their stature, and are never as easily placated once angered.",
      "headOGL":"debbie tan",
      "ogls":[  
         "joanna ee",
         "lao zhen xi"
      ]
   },
   "unicorn":{  
      "quote":"Stars were golden unicorns neighing unheard through blue meadows.",
      "by":"<i>Soldier's Pay</i>, William Faulkner ",
      "desc":"Fleeting as the comets that streak the cosmos, to catch a glimpse, unseen, of the elusive Unicorns is an incredible stroke of luck. Graceful and magnificent are these equine creatures, their sparkling bodies crowned by a single horn of purest ivory: the coronal jewel that boasts of both terrible beauty and fearful awe, piercing both the hearts of coldest stone and the armour of the thickest metals. Immortality is granted to those who drink of the Unicorns' milky blood, but cursed are they too for all eternity. It is for these reasons that the Unicorns are relentlessly pursued by prize hunters; however, the fleet-of-hoof Unicorns evade all capture, and finding one is a nigh impossible task.",
      "headOGL":"wynette yip",
      "ogls":[  
         "seah zenn han"
      ]
   },
   "goblin":{  
      "quote":"We must not look at goblin men,<br> We must not buy their fruits:<br> Who knows upon what soil they fed<br> Their hungry thirsty roots? ",
      "by":"<i>Goblin Market and Other Poems</i>, Christina Rossetti",
      "desc":"A distant relative of the Trolls, what the small, lanky Goblins lack in the Trolls’ prodigious strength they make up for in quick-witted intellect and a natural disposition towards arcane chicanery. Possessing their own unique brand of magic, the Goblins have gained a notorious reputation for a propensity to polymorph unsuspecting wanderers into sheep and disguising sacks of potatoes as pots of gold. Their excessive exercise of trickery and the art of deception has also made it almost impossible to fool a Goblin; victims who have attempted to give these little creatures a taste of their own medicine have found themselves to be once more at the receiving end of various devious traps the Goblins have had planned for them.",
      "headOGL":"vincent lee",
      "ogls":[  
         "kanageswari",
         "sim yi zhen"
      ]
   },
   "hippogriff":{  
      "quote":"But natural was the steed the wizard pressed;<br> For him a filly to griffin bore;<br> Hight hippogryph. In wings and beak and crest,<br> Formed like his sire, as in the feet before;<br> But like the mare, his dam, in all the rest.<br> Such on Riphaean hills, though rarely found,<br> Are bred, beyond the frozen ocean's bound.",
      "by":"<i>Orlando Furioso</i>, Ludovico Ariosto",
      "desc":"As the prized Pegasus is to Perseus, the Hippogriffs are the chosen steed for many a great knight and wizard, who ride these chimeric creatures — front quarters eagle, hind quarters horse — swiftly into battle. Proficient in combat, the Hippogriff mercilessly gouges the eyes of its enemies with its steel warbeak, before tearing them from limb to limb between its talons. It is, however, not only adept in fight but also flight, as its eyes flashes brilliantly cruel while evading pursuing enemies with swift flight and equine speed. With unparalleled loyalty, Hippogriffs never abandon their chosen riders, joining them into battle, even unto certain death.",
      "headOGL":"gracia lam",
      "ogls":[  
         "gerald mui"
      ]
   }
}

