[
    {
        "title": "EXODUS: ARRIVALS",
        "date": "30-07-2015",
        "content": "Touted as the largest tournament to be held in magic-kin history, the contestants for the annual Exodus tournament arrived at the Great Hall today, amidst great fanfare and loud cheers from the thronging crowd. This year, for its centennial anniversary, the tournament returns to the hallowed grounds of the Tembusu tower complex, the site of the original Exodus where the first Council had opened the Portal — the only time it has done so since the first tournament was held. The Council organisers are thus pulling out all the stops for this year’s celebration; preliminary predictions have pegged record-high numbers for both viewership and commercial revenue for the competition, while major broadcasting companies have been licensed to telecast the tournament proceedings live in all official magic-kin languages. This year’s tournament will also feature the best and brightest representatives of the 16 races that constitute the magic-kin kingdom, the highest number on record. The competition is surely fierce, and spectators are in for a treat never hitherto seen, as all manner of claw, talon, hoof and foot will be out for the tournament’s gruelling games, all for the fame and glory vested in the tournament title.\n\nThe excitement was already palpable in the Great Hall, where registrations and administration were already underway. Meeting for the first time, competitors crossed claws and butted heads in friendly pleasantries. Traditionally, the night before the official opening of the Exodus provided an important opportunity for the teams to acquaint themselves with one another, allowing them to forge makeshift alliances and analyse the rest of the competition. Exodus ambassadors also met their charges for the first time, and will be managing the teams’ needs and ensuring their well-being throughout the tournament. Ambassadors and masters will also supervise the teams in the execution of the tournament’s tasks, maintaining the integrity of this august event and enforcing all rules in a fair and just manner.\n\nThe tournament was first established by the Council as an avenue through which the races would resolve differences, but subsequent tournaments has seen the emergence of honourable competition and noble sportsmanship that has far exceeded the expectations of the Council. Now, beyond being the kingdom’s largest spectacle and the year’s — indeed, the century’s — most anticipated event, the tournament celebrates the goodwill that continues to be forged among the magic-kin, ties that will continue to last with every generation of magic-kin that participates in the Exodus.\n\nAs per customary practises, tomorrow’s grand opening will be officiated by the Council Headmaster, Prof. Gregory Clancey, before the teams will spend a day preparing for the Exodus tasks."
    }
]

