[
    {
        "title": "EXODUS: PERILOUS PREPARATIONS",
        "date": "30-07-2015",
        "img_url": "assets/data/updates/update-3-1.jpg",
        "img_url2": "assets/data/updates/update-3-2.jpg",
        "attachments": [],
        "is_live": true,
        "content": "Today the Exodus tournaments official begins. The contestants spent their first day since arrival out in the vast fields of the Tembusu tower complex in preparation for the main tournament tasks. As per tournament custom, the Council has prepared open supply caches scattered throughout tournament details, providing teams with the opportunity to gain substantial leads during task runs. Preparation day allowed teams to glean important information on the location of these supplies from their respective ambassadors, in anticipation of the often unscrupulous and fierce wrangling for key resources teams shall face in the heat of competition. Ambassadors also conducted preliminary tasks which divulged clues on the skills teams may require to use at key junctures during the tournament, and traditionally, these preparatory tasks also gave teams a good indication of the nature of the tournament’s main tasks.\n\nAs expected, our contestants face perilous tasks hitherto unseen in Exodus history, as gathered by our reporters on their tour with Team Lycanthrope. Among other things, teams were tasked to find treasure buried underwater, construct artificial lungs to endure areas filled with toxic gas, and re-create the notorious Marauder’s Map to navigate through hazardous territory inhabited by unknown creatures — activities which suggest that this year’s tasks would not only favour teams peculiarly skilled in conjuration and quick invention, but teams who fail in these tasks risk mortal danger. <img class=\"img-responsive vn-update-img pull-right top-margin-3 left-margin-3 bot-margin-3\" src=\"assets/data/updates/update-3-2.jpg\" />A match of Quidditch also seemed to indicate that prowess in flight and with the broomstick would be advantageous in at least one of the tasks. With the difficulties that present themselves already in these preliminary tasks, the Exodus tournament guarantees a host of arduous tasks that would test the true mettle of all 16 teams in contention for the tournament title.\n\nTo help against the psionic powers emanating from the deep magic of the tower complex, and also to ward off psychic assault deployed by certain teams, a Council Member also gave preparatory lesson in psionic defence in the late afternoon. According to tournament regulations, defence is mandatory due to the imperceptible and far-reaching effects of psychic assault, leading to unexpected consequences that may affect the integrity of tournament play.\n\nWhile the mystery shrouding over this year’s tasks has waned with preparation day, expectations for the grand tournament has only waxed with what we have seen. Ambassadors we spoke to agreed that teams will spend tonight planning and detailing strategies which push their advantages while exploiting others’ weaknesses. Will it be sheer brute strength, cunning trickery and deception, or sagely intelligence that triumphs in this year’s Exodus? Or has the Council something larger in store for the contestants? Find out tomorrow with our reporters, who will be on hand to catch all the exciting action when the 100th Exodus begins!"
    },
    {
        "title": "EXODUS: ARRIVALS",
        "date": "30-07-2015",
        "img_url": "assets/data/updates/update-2.jpg",
        "img_alt": "",
        "attachments": [{
            "name": "CORS Guide",
            "url": "assets/attachments/cors-guide.pptx"
        }],
        "is_live": true,
        "content": "Touted as the largest tournament to be held in magic-kin history, the contestants for the annual Exodus tournament arrived at the Great Hall today, amidst great fanfare and loud cheers from the thronging crowd. This year, for its centennial anniversary, the tournament returns to the hallowed grounds of the Tembusu tower complex, the site of the original Exodus where the first Council had opened the Portal — the only time it has done so since the first tournament was held. The Council organisers are thus pulling out all the stops for this year’s celebration; preliminary predictions have pegged record-high numbers for both viewership and commercial revenue for the competition, while major broadcasting companies have been licensed to telecast the tournament proceedings live in all official magic-kin languages. This year’s tournament will also feature the best and brightest representatives of the 16 races that constitute the magic-kin kingdom, the highest number on record. The competition is surely fierce, and spectators are in for a treat never hitherto seen, as all manner of claw, talon, hoof and foot will be out for the tournament’s gruelling games, all for the fame and glory vested in the tournament title.\n\nThe excitement was already palpable in the Great Hall, where registrations and administration were already underway. Meeting for the first time, competitors crossed claws and butted heads in friendly pleasantries. Traditionally, the night before the official opening of the Exodus provided an important opportunity for the teams to acquaint themselves with one another, allowing them to forge makeshift alliances and analyse the rest of the competition. Exodus ambassadors also met their charges for the first time, and will be managing the teams’ needs and ensuring their well-being throughout the tournament. Ambassadors and masters will also supervise the teams in the execution of the tournament’s tasks, maintaining the integrity of this august event and enforcing all rules in a fair and just manner.\n\nThe tournament was first established by the Council as an avenue through which the races would resolve differences, but subsequent tournaments has seen the emergence of honourable competition and noble sportsmanship that has far exceeded the expectations of the Council. Now, beyond being the kingdom’s largest spectacle and the year’s — indeed, the century’s — most anticipated event, the tournament celebrates the goodwill that continues to be forged among the magic-kin, ties that will continue to last with every generation of magic-kin that participates in the Exodus.\n\nAs per customary practises, tomorrow’s grand opening will be officiated by the Council Headmaster, Prof. Gregory Clancey, before the teams will spend a day preparing for the Exodus tasks."
    },
    {
        "title": "Origins of the Exodus",
        "date": "30-07-2015",
        "img_url": "assets/data/updates/update-1.jpg",
        "img_alt": "",
        "attachments": [],
        "is_live": true,
        "content": "In the dark days before the Exodus the great land bore her scars like fresh wounds, her screams reverberant with the agonised cries and writhing curses of those who languished under the ravages of war. Rivers of blood flowed down her once gay cheek, and her perfumed breath now reeked with the odours of burning forests and festering corpses. Thick smog issued whence gunpowder and arcane artillery had laid siege, plunging the land into iniquitous darkness, save for the hellfire that blazed through whole villages and kingdoms. Firmament’s guiding light had fled, the world was cast now in a doomed shadow, but still the wars did not abate. Driven on by blind beliefs and illusions of grandeur, the warring leaders suffered to lead their peoples into the clutches of the apocalyptic horsemen, all to prove a fatuous superiority over the creatures they were wont to share this dying land with. In rising tides of political instability and social strife, civil wars, rebellions and coups sprung forth as the cursed land sunk into anarchic chaos.\n\nIn a bid to save the remaining magic-kin, a Council was convened, comprising an elder from each race. For salvation, the Council looked towards the last hallowed ground left on the land — the great Tembusu tree, whose roots still reached into deep earth, steeped in the ancient magics that had once allowed life to flourish on the land. Together, drawing on erudite arcane knowledge pieced together from dusty grimoires, the Council opened a gateway to a young world nestled in the cosmic branches of Tembusu. As the hinterlands of the old world crumbled away, those who shared the Council’s vision left for this new world in a mass Exodus, eager to start life anew. Upon the broken pieces of the world they had escaped from the new city of magic-kin was founded, led by the Council. Over years of relative peace, under the guidance of the Council of Special Creatures, successors of the original elders, the city flourished in verdant growth. At the heart of this blossoming kingdom was the Tembusu, a monument testament to the endless possibilities afforded by unity in diversity; but it too was a vestige of the lost world the magic-kin had left behind, a grim reminder of a land torn apart by divisive conflict.\n\nIn remembrance of the great wars that were waged in the days before the magic-kin arrived in this brave new world, the Council established the Exodus, in hope that within the crucible of competition, new lasting ties will crystallise among the young magic-kin of different races, and remind them of the boundless opportunities that avail to them in a nation founded upon the tenets of unity, friendship and communal solidarity. This year’s Exodus will be held in the Tembusu tower complex, suffused with the magic of the venerable Tembusu, returning the tournament to its revered roots."
    }
]

